airfoil-0-sparse/Corse/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-5 -5 0) //0     Back face
    (-0.04535 -5 0) //1
    (1 -5 0) //2
    (10 -5 0) //3
    (-5 -0.092553 0) //4
    (-0.04535 -0.092553 0) //5
    (1 -0.086603 0) //6
    (10 -0.086603 0) //7
    (0.00465 -0.00595 0) //8
    (1 0 0) //9
    (10 0 0) //10
    (0.01867 0.01744 0) //11
    (-5 0.104043 0) //12
    (-0.03133 0.104043 0) //13
    (1 0.086603 0) //14
    (10 0.086603 0) //15
    (-5 5 0) //16
    (-0.03133 5 0) //17
    (1 5 0) //18
    (10 5 0) //19

    (-5 -5 0.01) //0    Front  face (vertex+20)
    (-0.04535 -5 0.01) //1
    (1 -5 0.01) //2
    (10 -5 0.01) //3
    (-5 -0.092553 0.01) //4
    (-0.04535 -0.092553 0.01) //5
    (1 -0.086603 0.01) //6
    (10 -0.086603 0.01) //7
    (0.00465 -0.00595 0.01) //8
    (1 0 0.01) //9
    (10 0 0.01) //10
    (0.01867 0.01744 0.01) //11
    (-5 0.104043 0.01) //12
    (-0.03133 0.104043 0.01) //13
    (1 0.086603 0.01) //14
    (10 0.086603 0.01) //15
    (-5 5 0.01) //16
    (-0.03133 5 0.01) //17
    (1 5 0.01) //18
    (10 5 0.01) //19

 
    (-5 0 0) //40      Back
    (-0.1 0 0) //41
    (0 0 0) //42
    (-5 0 0.01) //43   Front
    (-0.1 0 0.01) //44
    (0 0 0.01) //45

);

blocks          
(
    hex (0 1 5 4 20 21 25 24) (15 10 1) simpleGrading (.025 .025 1) //block 0
    hex (1 2 6 5 21 22 26 25) (12 10 1) edgeGrading (10 10 10 10 .025 .025 .025 .025 1 1 1 1) //block 1
    hex (2 3 7 6 22 23 27 26) (20 10 1) simpleGrading (3.75 .025 1) //block 2
    hex (4 5 41 40 24 25 44 43) (15 2 1) simpleGrading (.025 1 1) //block 3
    hex (5 8 42 41 25 28 45 44) (10 2 1) simpleGrading (0.1 1 1) //block 4
    hex (5 6 9 8 25 26 29 28) (12 10 1) edgeGrading ( 10 16 16 10  .1 .1 .1 0.1 1 1 1 1) //block 5
    hex (6 7 10 9 26 27 30 29) (20 10 1) simplpeGrading (3.75 0.1 1) //block 6
    hex (40 41 13 12 43 44 33 32) (15 2 1) edgeGrading (.025 0.03 0.03 0.025 1 1 1 1 1 1 1 1) //block 7
    hex (41 42 11 13 44 45 31 33) (10 2 1) edgeGrading (0.1 0.1 0.1 0.1 1 2 2 1 1 1 1 1) //block 8
    hex (11 9 14 13 31 29 34 33) (10 10 1) edgeGrading (5 4 4 5 10 10 10 10 1 1 1 1) //block 9
    hex (9 10 15 14 29 30 35 34) (20 10 1) simpleGrading (3.75 10 1) //block 10
    hex (12 13 17 16 32 33 37 36) (15 10 1) simpleGrading (.03 40 1) //block 11
    hex (13 14 18 17 33 34 38 37) (10 10 1) simpleGrading (4 4 4 4 40 40 40 40 1 1 1 1) //block 12
    hex (14 15 19 18 34 35 39 38) (20 10 1) simpleGrading (3.75 40 1) //block 13
);

edges           
(
    arc 5 41 (-0.085 -0.048 0)
    arc 25 44 (-0.085 -0.048 0.01)
    arc 13 41 (-0.08 0.06 0)
    arc 33 44 (-0.08 0.06 0.01)
    arc 13 14 (.5 .13 0)
    arc 33 34 (.5 .13 0.01)
    spline 42 11  (  (0.00075 0.0022 0)
		    ( 0.0015000 0.0039000 0)
		    (0.002 0.00448397 0)
		    (0.004 0.00670609 0)
		    (0.0055 0.00825319 0)
		    (0.0078600 0.0104800 0)
		    (0.01 0.0122801 0)
		    (0.012 0.0137739 0)
		    (0.014 0.0150858 0)
		    (0.0165 0.0164695 0)
		     )// (1 1 0) (-1 -1 0)
    spline 45 31  (  (0.00075 0.0022 0.01)
		    ( 0.0015000 0.0039000 0.01)
		    (0.002 0.00448397 0.01)
		    (0.004 0.00670609 0.01)
		    (0.0055 0.00825319 0.01)
		    (0.0078600 0.0104800 0.01)
		    (0.01 0.0122801 0.01)
		    (0.012 0.0137739 0.01)
		    (0.014 0.0150858 0.01)
		    (0.0165 0.0164695 0.01)
		     )// (1 1 0) (-1 -1 0)
    spline 11 9   ( (0.0338800 0.0243900 0)
		      (0.0534400 0.0310400 0)
		      (0.0772500 0.0372100 0)
		      (0.1051300 0.0427500 0)
		      (0.1368900 0.0475500 0)
		      (0.1722600 0.0515100 0)
		      (0.2109500 0.0545600 0)
		      (0.2526200 0.0566600 0)
		      (0.2969200 0.0578000 0)
		      (0.3434300 0.0580000 0)
		      (0.3917200 0.0572700 0)
		      (0.4413300 0.0557000 0)
		      (0.4917800 0.0533400 0)
		      (0.5425400 0.0502900 0)
		      (0.5931000 0.0466600 0)
		      (0.6429200 0.0425600 0)
		      (0.6914499 0.0381100 0)
		      (0.7381700 0.0334400 0)
		      (0.7825500 0.0286700 0)
		      (0.8240500 0.0239400 0)
		      (0.8621800 0.0193700 0)
		      (0.8964700 0.0150600 0)
		      (0.9264500 0.0111200 0)
		      (0.9516900 0.0076000 0)
		      (0.9719400 0.0044600 0)
		      (0.9870700 0.0019500 0)
		      (0.9966700 0.0004500 0)
		      )
    spline 31 29   ((0.0338800 0.0243900 0.01)
		      (0.0534400 0.0310400 0.01)
		      (0.0772500 0.0372100 0.01)
		      (0.1051300 0.0427500 0.01)
		      (0.1368900 0.0475500 0.01)
		      (0.1722600 0.0515100 0.01)
		      (0.2109500 0.0545600 0.01)
		      (0.2526200 0.0566600 0.01)
		      (0.2969200 0.0578000 0.01)
		      (0.3434300 0.0580000 0.01)
		      (0.3917200 0.0572700 0.01)
		      (0.4413300 0.0557000 0.01)
		      (0.4917800 0.0533400 0.01)
		      (0.5425400 0.0502900 0.01)
		      (0.5931000 0.0466600 0.01)
		      (0.6429200 0.0425600 0.01)
		      (0.6914499 0.0381100 0.01)
		      (0.7381700 0.0334400 0.01)
		      (0.7825500 0.0286700 0.01)
		      (0.8240500 0.0239400 0.01)
		      (0.8621800 0.0193700 0.01)
		      (0.8964700 0.0150600 0.01)
		      (0.9264500 0.0111200 0.01)
		      (0.9516900 0.0076000 0.01)
		      (0.9719400 0.0044600 0.01)
		      (0.9870700 0.0019500 0.01)
		      (0.9966700 0.0004500 0.01)
		      )
    // spline 42 8  (( 0.0002200 -.0013900 0)) 
    // spline 28 45  (( 0.0002200 -.0013900 0.01))
    arc 42 8  ( 0.0002200 -.0013900 0) 
    arc 28 45  ( 0.0002200 -.0013900 0.01)

    spline 8 9 (
		  (0.0144700 -.0105500 0)
		  (0.0293800 -.0146800 0)
		  (0.0493100 -.0182400 0)
		  (0.0741200 -.0211600 0)
		  (0.1036300 -.0234600 0)
		  (0.1375600 -.0251500 0)
		  (0.1755900 -.0262900 0)
		  (0.2173000 -.0269000 0)
		  (0.2622700 -.0270500 0)
		  (0.3099800 -.0268000 0)
		  (0.3598900 -.0261900 0)
		  (0.4114400 -.0252700 0)
		  (0.4640100 -.0240900 0)
		  (0.5170100 -.0226700 0)
		  (0.5697900 -.0210500 0)
		  (0.6217500 -.0192100 0)
		  (0.6722700 -.0171800 0)
		  (0.7207300 -.0148000 0)
		  (0.7668900 -.0119400 0)
		  (0.8105700 -.0089000 0)
		  (0.8512100 -.0061200 0)
		  (0.8881100 -.0038200 0)
		  (0.9206300 -.0020900 0)
		  (0.9481700 -.0009100 0)
		  (0.9702600 -.0001900 0)
		  (0.9865400 0.0001200 0)
		  (0.9965900 0.0000800 0)
		  )

   spline 28 29 (
		   (0.0144700 -.0105500 0.01)
		   (0.0293800 -.0146800 0.01)
		   (0.0493100 -.0182400 0.01)
		   (0.0741200 -.0211600 0.01)
		   (0.1036300 -.0234600 0.01)
		   (0.1375600 -.0251500 0.01)
		   (0.1755900 -.0262900 0.01)
		   (0.2173000 -.0269000 0.01)
		   (0.2622700 -.0270500 0.01)
		   (0.3099800 -.0268000 0.01)
		   (0.3598900 -.0261900 0.01)
		   (0.4114400 -.0252700 0.01)
		   (0.4640100 -.0240900 0.01)
		   (0.5170100 -.0226700 0.01)
		   (0.5697900 -.0210500 0.01)
		   (0.6217500 -.0192100 0.01)
		   (0.6722700 -.0171800 0.01)
		   (0.7207300 -.0148000 0.01)
		   (0.7668900 -.0119400 0.01)
		   (0.8105700 -.0089000 0.01)
		   (0.8512100 -.0061200 0.01)
		   (0.8881100 -.0038200 0.01)
		   (0.9206300 -.0020900 0.01)
		   (0.9481700 -.0009100 0.01)
		   (0.9702600 -.0001900 0.01)
		   (0.9865400 0.0001200 0.01)
		   (0.9965900 0.0000800 0.01)
		   )


    //polySpline 42 11 (( 0.0015000 0.0039000 0)
    //	      ( 0.0078600 0.0104800 0)) (-1 0 0) (-1 0 0)
    //simpleSpline 42 8  (( 0.0002200 -.0013900 0)) //(0 -.001 0) (0 .001 0)
    //    polySpline 45 31 (( 0.0015000 0.0039000 0.01)
    //		      ( 0.0078600 0.0104800 0.01)) (0 1 0) (0 1 0)
    //polySpline 28 45  (( 0.0002200 -.0013900 0.01)) (1 0 0) (1 0 0)
);

patches         
(
    patch inlet 
    (
        (0 20 24 4)
	(4 24 43 40)
	(40 43 32 12)
	(12 32 36 16)
    )
    patch outlet
    (
        (3 7 27 23)
        (7 10 30 27)
	(10 15 35 30)
	(15 19 39 35)
    )
    patch topBottom 
    (
        (0 1 21 20)
        (1 2 22 21)
        (2 3 23 22)
        (17 16 36 37)
        (18 17 37 38)
        (19 18 38 39)
    )
    wall wing
    (
        (42 8 28 45)
	(8 9 29 28)
	(9 11 31 29)
	(11 42 45 31)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
