airfoil-0-sparse/Corse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          24;
        startFace       3189;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       3213;
    }
    topBottom
    {
        type            patch;
        nFaces          92;
        startFace       3253;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          26;
        startFace       3345;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3280;
        startFace       3371;
    }
)

// ************************************************************************* //
