airfoil-0-sparse/Corse/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (25 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (25 0 0);
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform (25 0 0);
    }

    wing
    {
        type            noSlip;
    }

    topBottom
    {
        type            freestream;
        freestreamValue uniform (25 0 0);
    }
}

// ************************************************************************* //
